# First print your name in the cell below then save this file. (or something nice about your instructor)

In [5]:
# In this cell print your name 
print("Tasmia Chowdhury")

Tasmia Chowdhury

# Data wrangling with Pandas exercise
* For this exercise we will be using the `listings.csv` data file.

In [7]:
import pandas as pd
import numpy as np

# Load in the data file using `pd.read_csv()`

In [8]:
# Load data here
df = pd.read_csv("data/listings.csv")
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,175,3,48,2019-11-04,0.37,2,365
1,3831,"Whole flr w/private bdrm, bath & kitchen(pls r...",4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,75,1,340,2020-08-01,4.75,1,265
2,5121,BlissArtsSpace!,7356,Garon,Brooklyn,Bedford-Stuyvesant,40.68688,-73.95596,Private room,60,29,50,2019-12-02,0.37,1,365
3,5136,"Spacious Brooklyn Duplex, Patio + Garden",7378,Rebecca,Brooklyn,Sunset Park,40.66120,-73.99423,Entire home/apt,175,14,1,2014-01-02,0.01,1,295
4,5178,Large Furnished Room Near B'way,8967,Shunichi,Manhattan,Hell's Kitchen,40.76489,-73.98493,Private room,65,2,473,2020-03-15,3.44,1,340

## Exercise 2 - Filtering

Return the following subsets of the dataframe.

1. How many listings are there with a price less than 100? 


2. Find how many listings there are in just Brooklyn.


3. Find how many listings there are in Brooklyn with a price less than 100.


4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.


5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  The prices for all other listings should be the same as the were before. 


6. What % of the rooms are private, and what % of the rooms are shared.  
    * Hint, use `.value_counts()`

In [9]:
# 1. How many listings are there with a price less than 100? 
listings_under_100 = df[df['price'] < 100]
len(listings_under_100)
#listings_under_100.head()

22778

In [12]:
# 2. Make a new DataFrame of listings in Brooklyn named `df_bk` 
# and find how many listings in just Brooklyn.
select_condition = df['neighbourhood_group'] == 'Brooklyn'

df_bk = df[ select_condition ].copy()
df_bk.head()
len(df_bk)

18632

In [16]:
# 3. Find how many listings there are in Brooklyn with a price less than 100.
bk_100 = df[(df['neighbourhood_group'] == 'Brooklyn') & (df['price'] < 100)]
len(bk_100)
#bk_100.head()

10473

In [22]:
# 4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.
# How many total are there that have those names

cool_dudes = ['Michael', 'David', 'John', 'Daniel']

# Create our select condition aka 'boolean mask'
condition = df['host_name'].isin(cool_dudes)

# Display the filtered data
host_name_counts= df[condition]['host_name'].value_counts()
total = df[condition].shape[0]

host_name_counts, total

(Michael    387
 David      348
 John       270
 Daniel     253
 Name: host_name, dtype: int64,
 1258)

In [28]:
# 5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  
# The prices for all other listings should be the same as the were before. 
df['adjusted_price'] = df['price']

# Adjust the price for Williamsburg listings by $100 without using .loc
williamsburg_condition = df['neighbourhood'] == 'Williamsburg'

# Update the 'adjusted_price' column for Williamsburg by adding 100 - it is times bc true is 1 
df['adjusted_price'] = df['adjusted_price'] + williamsburg_condition * 100

# Optional: Inspect the changes in Williamsburg listings
williamsburg_adjusted = df[williamsburg_condition][['neighbourhood','price', 'adjusted_price']]

# Display the adjusted prices for Williamsburg listings
williamsburg_adjusted.head()

   neighbourhood  price  adjusted_price
11  Williamsburg    109             209
15  Williamsburg    299             399
35  Williamsburg    131             231
38  Williamsburg    175             275
42  Williamsburg     80             180

In [30]:
# 6. What % of the rooms are private, and what % of the rooms are shared.  

dfp = df.room_type.value_counts(normalize=True) 
dfp
private_percentage = dfp.get('Private room', 0)
shared_percentage = dfp.get('Shared room', 0)

private_percentage, shared_percentage

(0.45444580566122894, 0.0212134889419047)

# Exercise 3 - Grouping

1. Using `groupby`, count how many listings are in each neighbourhood_group.


2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 


3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 


4. Using `groupby`, find the median price for each room type in each neighbourhood_group.


5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices for each room type in each neighbourhood_group.

In [35]:
# 1. Using `groupby`, count how many listings are in each neighbourhood_group.

listings_count = df.groupby('neighbourhood_group').size()
listings_count

neighbourhood_group
Bronx             1183
Brooklyn         18632
Manhattan        20580
Queens            5791
Staten Island      341
dtype: int64

In [36]:
# 2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 
mean_price = df.groupby('neighbourhood_group')['price'].mean()
mean_price

neighbourhood_group
Bronx             92.751479
Brooklyn         120.225258
Manhattan        191.880466
Queens            99.754965
Staten Island    110.947214
Name: price, dtype: float64

In [37]:
# 2.5. Using `groupby`, find the mean price for each room_type. 
mean_room_price = df.groupby('room_type')['price'].mean()
mean_room_price

room_type
Entire home/apt    199.395950
Hotel room         275.015075
Private room        91.453084
Shared room         87.063830
Name: price, dtype: float64

In [38]:
# 3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 
gb = df.groupby('neighbourhood_group')
gb['price'].agg( ['min', 'max'] )

                     min    max
neighbourhood_group
Bronx                 16   1404
Brooklyn               0  10000
Manhattan              0  10000
Queens                 0  10000
Staten Island         19   1200

In [39]:
# 4. Using `groupby`, find the mean price for each room_type in each neighbourhood_group.
median_price_room = df.groupby(['neighbourhood_group', 'room_type'])['price'].mean()
median_price_room

neighbourhood_group  room_type
Bronx                Entire home/apt    138.004819
                     Private room        68.419668
                     Shared room         66.391304
Brooklyn             Entire home/apt    171.587687
                     Hotel room         147.300000
                     Private room        71.291189
                     Shared room         57.870091
Manhattan            Entire home/apt    231.335572
                     Hotel room         292.515670
                     Private room       128.277069
                     Shared room        111.735084
Queens               Entire home/apt    150.168900
                     Hotel room         139.058824
                     Private room        69.972564
                     Shared room         89.891892
Staten Island        Entire home/apt    151.720930
                     Private room        70.312883
                     Shared room         46.000000
Name: price, dtype: float64

In [40]:
# 5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices 
# for each room type in each neighbourhood_group.

room_n = df.groupby(['neighbourhood_group', 'room_type'])
room_n['price'].agg( ['count', 'min', 'max', 'mean', 'median', 'std', 'sum'] )

                                     count  min    max        mean  median  \
neighbourhood_group room_type
Bronx               Entire home/apt    415   25   1404  138.004819     103
                    Private room       722   16    700   68.419668      55
                    Shared room         46   20    800   66.391304      44
Brooklyn            Entire home/apt   9112   20  10000  171.587687     135
                    Hotel room          30    0    399  147.300000     129
                    Private room      9159   10   2500   71.291189      60
                    Shared room        331   15   1500   57.870091      36
Manhattan           Entire home/apt  12209    0  10000  231.335572     165
                    Hotel room         351    0   2211  292.515670     210
                    Private room      7601   10  10000  128.277069      80
                    Shared room        419   10  10000  111.735084      60
Queens              Entire home/apt   2090   10  10000  150.168900     115
                    Hotel room          17    0    249  139.058824     149
                    Private room      3499   18   9000   69.972564      55
                    Shared room        185   14   3000   89.891892      40
Staten Island       Entire home/apt    172   39   1200  151.720930     111
                    Private room       163   20    800   70.312883      55
                    Shared room          6   19     82   46.000000      38

                                            std      sum
neighbourhood_group room_type
Bronx               Entire home/apt  126.032106    57272
                    Private room      57.337866    49399
                    Shared room      114.442703     3054
Brooklyn            Entire home/apt  236.732843  1563507
                    Hotel room        91.153206     4419
                    Private room      69.023165   652956
                    Shared room       92.217618    19155
Manhattan           Entire home/apt  410.306439  2824376
                    Hotel room       315.924085   102673
                    Private room     448.677306   975034
                    Shared room      502.728868    46817
Queens              Entire home/apt  252.606739   313853
                    Hotel room        50.743806     2364
                    Private room     163.814468   244834
                    Shared room      275.675158    16630
Staten Island       Entire home/apt  147.518392    26096
                    Private room      70.759593    11461
                    Shared room       28.446441      276

# Load, Merge, and Export files.
1. Load the `prices.csv` and the `n_listings.csv`
    * Having an error..? Inspect the actual csv file if you're having trouble

2. Do join that keeps all the records for each table.
    * Neighbourhood groups should include ['Bronx', 'Brooklyn', 'Manhattan', 'Queens', 'Staten Island',
       'LongIsland']

       
3. Save your joined csv as `joined.csv` into the data folder. 


4. Load your saved table and see if it looks the same or different that the DataFrame you used to create it.

In [57]:
# 1. Load the `prices.csv` and the `n_listings.csv`
import pandas as pd

# Load the CSV files
prices = pd.read_csv('data/prices.csv')
listings = pd.read_csv('data/n_listings.csv', delimiter=';')
prices.columns = prices.columns.str.strip()
listings.columns = listings.columns.str.strip()
print(prices.info)
print(listings.info)

<bound method DataFrame.info of   neighbourhood_group  mean_price
0               Bronx   92.751479
1            Brooklyn  120.225258
2           Manhattan  191.880466
3              Queens   99.754965
4       Staten Island  110.947214>
<bound method DataFrame.info of   neighbourhood_group  n_listings
0               Bronx        1183
1            Brooklyn       18632
2           Manhattan       20580
3          LongIsland        4121>

In [66]:
# 2. Do join that keeps all the records for each table.
neighbourhood_groups = ['Bronx', 'Brooklyn', 'Manhattan', 'Queens', 'Staten Island', 'LongIsland']

# Filter both DataFrames
prices_filtered = prices[prices['neighbourhood_group'].isin(neighbourhood_groups)]
listings_filtered = listings[listings['neighbourhood_group'].isin(neighbourhood_groups)]

joined_df = pd.merge(prices_filtered, listings_filtered, on='neighbourhood_group', how='outer')

joined_df.head()

  neighbourhood_group  mean_price  n_listings
0               Bronx   92.751479      1183.0
1            Brooklyn  120.225258     18632.0
2           Manhattan  191.880466     20580.0
3              Queens   99.754965         NaN
4       Staten Island  110.947214         NaN

In [68]:
# 3. Save your joined csv as `joined.csv` into the data folder. 
joined_df.to_csv('data/joined.csv', index=False)

In [69]:
# 4. Load your newly saved file, see if it looks the same.  If not, try saving with argument `index=False`
loaded_df = pd.read_csv('data/joined.csv')

# Display the first few rows to verify
print(loaded_df.head())

# Optionally, compare the DataFrames
print(joined_df.equals(loaded_df))

  neighbourhood_group  mean_price  n_listings
0               Bronx   92.751479      1183.0
1            Brooklyn  120.225258     18632.0
2           Manhattan  191.880466     20580.0
3              Queens   99.754965         NaN
4       Staten Island  110.947214         NaN
True

# Extra Credit
Every question below this cell is extra credit and optional.

### 1. (Easy) Explore this new PandasAI Package and tell me what its all about because I've never used it. 
* https://www.youtube.com/watch?v=5w6eZaoDVVk&ab_channel=CodingIsFun  
* See if you can use it on the listings.csv to find out some cool info. or answer some of the questions above.

### 2. (Very Easy) Find other cool Panda packages / add ons and show us what they can do well. And how you installed them.

### 3. (Medium) Use the grammys.csv data for the next section of questions.

1. Who was won Album of the Year in 2016?


2. Who won Best Rap Album in 2009?


3. How many awards was Kendrick Lamar nomiated for, and how many did he win...?

### (Hard) Load the Game Logs for 2022 and add the column names using a dictionary.  
* [Link to the data page](https://www.retrosheet.org/gamelogs/)
* [Link to the column names](https://procatinator.com/)
* haha, gotta find them yourself!

### (Extra Hard) Download the files for the past 5 years into a new folder and add them all into one data frame using pandas, then save that new file.
* Try to not hard code in the file names. We want to do this programmatically because what if we want to add new/more file names in the future.